In [112]:
import glob
import pandas as pd
import numpy as np
import re

In [113]:
csv_files = glob.glob('./*.csv')
dataframes=[]
col_names_list = []
for x in csv_files:
    dataframes.append(pd.read_csv(x, low_memory = False))
    col_names_list.append(list(dataframes[-1].columns))

In [114]:
#checks to see if the df has anything to signify country
[[csv_files[y],sum([bool(re.search('ountry',x)) for x in col_names_list[y]])>0] for y in range(len(col_names_list))]

[['.\\city_temperature.csv', True],
 ['.\\EdStatsData.csv', True],
 ['.\\global-city-population-estimates-CITIES-OVER-300K.csv', True],
 ['.\\Qol_data.csv', False],
 ['.\\WPP2019_PopulationByAgeSex_Medium.csv', False],
 ['.\\WRP national data.csv', False]]

In [115]:
Temp_df = dataframes[0].copy()
Ed_df = dataframes[1].copy()
City_pop_df = dataframes[2].copy()
QoL_df = dataframes[3].copy()
Age_df = dataframes[4].copy()
Rel_df = dataframes[5].copy()

In [116]:
for idx in range(6):
    names = col_names_list[idx]
    print(idx)
    print('csv file:' + csv_files[idx])
    for name in names:
        if bool(re.search('ountry',name)):
                print('column name:' + name + '\n','first entry:' + str(dataframes[idx][name][0]) + '\n')

0
csv file:.\city_temperature.csv
column name:Country
 first entry:Algeria

1
csv file:.\EdStatsData.csv
column name:Country Name
 first entry:Arab World

column name:Country Code
 first entry:ARB

2
csv file:.\global-city-population-estimates-CITIES-OVER-300K.csv
column name:Country Code
 first entry:392

column name:Country or area
 first entry:Japan

3
csv file:.\Qol_data.csv
4
csv file:.\WPP2019_PopulationByAgeSex_Medium.csv
5
csv file:.\WRP national data.csv

In [117]:
QoL_df.head()

,year,City,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index
0,2012-Q1,"Berlin, Germany",215.25,140.62,77.34,64.81,89.06,5.74,23.00,40.00
1,2012-Q1,"Zurich, Switzerland",213.18,136.31,83.85,77.78,166.07,8.27,27.33,26.50
2,2012-Q1,"Edmonton, Canada",204.86,124.69,58.98,78.89,112.10,3.59,35.33,21.25
3,2012-Q1,"Perth, Australia",196.00,118.34,48.75,87.04,142.18,5.24,27.00,15.00
4,2012-Q1,"Calgary, Canada",190.78,124.25,71.88,70.42,111.71,4.58,62.00,25.08

In [118]:
QoL_df['year'].unique()

array(['2012-Q1', '2013-Q1', '2014', '2014-mid', '2015', '2015-mid',
       '2016', '2016-mid', '2017', '2017-mid', '2018', '2018-mid', '2019',
       '2019-mid', '2020', '2020-mid', '2021', '2021-mid'], dtype=object)

In [174]:
QoL_df = dataframes[3].copy()
city_list = list(dataframes[3].copy()['City'].str.split(','))
country_list = []
city_list_df = []
for city in city_list:
    country_list.append(city[-1])
    city_list_df.append( city[0])
QoL_df['Country'] = country_list
QoL_df['City'] = city_list_df
QoL_df.head()

,year,City,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Country
0,2012-Q1,Berlin,215.25,140.62,77.34,64.81,89.06,5.74,23.00,40.00,Germany
1,2012-Q1,Zurich,213.18,136.31,83.85,77.78,166.07,8.27,27.33,26.50,Switzerland
2,2012-Q1,Edmonton,204.86,124.69,58.98,78.89,112.10,3.59,35.33,21.25,Canada
3,2012-Q1,Perth,196.00,118.34,48.75,87.04,142.18,5.24,27.00,15.00,Australia
4,2012-Q1,Calgary,190.78,124.25,71.88,70.42,111.71,4.58,62.00,25.08,Canada

In [120]:
dataframes[5]['name'].unique()

array(['USA', 'CAN', 'BHM', 'CUB', 'HAI', 'DOM', 'JAM', 'TRI', 'BAR',
       'DMA', 'GRN', 'SLU', 'SVG', 'AAB', 'SKN', 'MEX', 'BLZ', 'GUA',
       'HON', 'SAL', 'NIC', 'COS', 'PAN', 'COL', 'VEN', 'GUY', 'SUR',
       'ECU', 'PER', 'BRA', 'BOL', 'PAR', 'CHL', 'ARG', 'URU', 'UKG',
       'IRE', 'NTH', 'BEL', 'LUX', 'FRN', 'MNC', 'LIE', 'SWZ', 'SPN',
       'AND', 'POR', 'GMY', 'GFR', 'GDR', 'POL', 'AUS', 'HUN', 'CZE',
       'CZR', 'SLO', 'ITA', 'SNM', 'MLT', 'ALB', 'MNG', 'MAC', 'CRO',
       'YUG', 'BOS', 'KOS', 'SLV', 'GRC', 'CYP', 'BUL', 'MLD', 'ROM',
       'RUS', 'EST', 'LAT', 'LIT', 'UKR', 'BLR', 'ARM', 'GRG', 'AZE',
       'FIN', 'SWD', 'NOR', 'DEN', 'ICE', 'CAP', 'STP', 'GNB', 'EQG',
       'GAM', 'MLI', 'SEN', 'BEN', 'MAA', 'NIR', 'CDI', 'GUI', 'BFO',
       'LBR', 'SIE', 'GHA', 'TOG', 'CAO', 'NIG', 'GAB', 'CEN', 'CHA',
       'CON', 'DRC', 'UGA', 'KEN', 'TAZ', 'BUI', 'RWA', 'SOM', 'DJI',
       'ETH', 'ERI', 'ANG', 'MZM', 'ZAM', 'ZIM', 'MAW', 'SAF', 'NAM',
       'LES', 'BOT', 'SWA', 'MAG', 'COM', 'MAS', 'SEY', 'MOR', 'ALG',
       'TUN', 'LIB', 'SUD', 'IRN', 'TUR', 'IRQ', 'EGY', 'SYR', 'LEB',
       'JOR', 'ISR', 'SAU', 'YAR', 'YEM', 'YPR', 'KUW', 'BAH', 'QAT',
       'UAE', 'OMA', 'AFG', 'TKM', 'TAJ', 'KYR', 'UZB', 'KZK', 'CHN',
       'MON', 'TAW', 'PRK', 'ROK', 'JPN', 'IND', 'BHU', 'PAK', 'BNG',
       'MYA', 'SRI', 'MAD', 'NEP', 'THI', 'CAM', 'LAO', 'DRV', 'RVN',
       'MAL', 'SIN', 'BRU', 'PHI', 'INS', 'ETM', 'AUL', 'PNG', 'NEW',
       'VAN', 'SOL', 'KIR', 'TUV', 'FIJ', 'TON', 'NAU', 'MSI', 'PAL',
       'FSM', 'WSM'], dtype=object)

In [147]:
Age_df.head()

       Country  Time AgeGrp  AgeGrpPct
0  Afghanistan  2012    0-4  17.356145
1  Afghanistan  2012    5-9  15.870758
2  Afghanistan  2012  10-14  13.862917
3  Afghanistan  2012  15-19  11.174352
4  Afghanistan  2012  20-24   8.703264

In [164]:
Age_df = dataframes[4].copy()
Age_df['Country'] = Age_df['Location']
Age_df_m = pd.DataFrame(Age_df[['Location', 'Time', 'PopTotal']].groupby(by = ['Location','Time'],as_index = False).sum())
Age_df_m = Age_df.merge(Age_df_m, on = ['Location', 'Time'], how = 'left')
Age_df_m['AgeGrpPct'] = 100* Age_df_m['PopTotal_x']/Age_df_m['PopTotal_y']
Age_df_m = Age_df_m[['Country', 'Time', 'AgeGrp','AgeGrpPct']]
Age_df = Age_df_m
Age_df = Age_df[(Age_df['Time']>2011) & (Age_df['Time']<2021)].reset_index(drop = True)
fert_list=[]
for grp in  Age_df['AgeGrp']:
    oldest = int(str(grp).split('-')[-1].replace('+',''))
    if (oldest>14) & (oldest<50):
        fert_list.append(1)
    else:
        fert_list.append(0)
        
Age_df['Fertile'] = fert_list
Age_df = Age_df.drop('AgeGrp', axis = 1)
Age_df = Age_df.groupby(by = ['Country','Time','Fertile']).sum().reset_index()
Age_df = Age_df[Age_df['Fertile'] == 1].drop('Fertile',axis = 1).reset_index(drop = True)
col = list(Age_df.columns[:-1])
col.append('Percent Fertile')
Age_df.columns = col
Age_df.head()

       Country  Time  Percent Fertile
0  Afghanistan  2012        44.634149
1  Afghanistan  2013        45.294074
2  Afghanistan  2014        45.983435
3  Afghanistan  2015        46.678024
4  Afghanistan  2016        47.197775

In [139]:
col = Rel_df.columns
print(col)

Index(['year', 'name', 'chrstpct', 'judpct', 'islmpct', 'budpct', 'zorpct',
       'hinpct', 'sikhpct', 'shntpct', 'bahpct', 'taopct', 'jainpct', 'conpct',
       'synpct', 'anmpct', 'nonpct', 'othrpct', 'sumpct'],
      dtype='object')

In [125]:
Rel_df = dataframes[5].copy()[dataframes[5].copy()['year'] == 2010].reset_index(drop = True)
col = Rel_df.columns
col2 = col[0:3:2].append(Rel_df.columns[40:75])
Rel_df = Rel_df[col2]
prefs = ['chrst', 'jud', 'islm','bud', 'zor', 'hin', 'sikh' ,'shnt', 'bah', 'tao', 'jain', 'con', 'syn','anm','non','othr','sum']
Rel_df2 = Rel_df.copy()
for pref in prefs:
    Rel_df2[pref + 'pct'] = np.zeros(len(Rel_df2))
    for name in col2:
        if name[0:len(pref)] == pref:
            Rel_df2[pref + 'pct'] = Rel_df2[pref + 'pct'] + Rel_df2[name]
            Rel_df2 = Rel_df2.drop(name, axis = 1)
Rel_df = Rel_df2.copy()
Rel_df.head()

,year,name,chrstpct,judpct,islmpct,budpct,zorpct,hinpct,sikhpct,shntpct,bahpct,taopct,jainpct,conpct,synpct,anmpct,nonpct,othrpct,sumpct
0,2010,USA,1.4908,0.0381,0.0180,0.0218,0.0053,0.0057,0.0013,0.0005,0.0015,0.0000,0.0003,0.0003,0.0026,0.0057,0.1900,0.0025,0.0
1,2010,CAN,1.5322,0.0199,0.0388,0.0388,0.0002,0.0080,0.0080,0.0000,0.0005,0.0001,0.0001,0.0001,0.0008,0.0021,0.1643,0.0010,0.0
2,2010,BHM,1.9320,0.0020,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0003,0.0000,0.0000,0.0000,0.0032,0.0290,0.0005,0.0
3,2010,CUB,1.3178,0.0002,0.0014,0.0000,0.0000,0.0022,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.5000,0.0000,0.1315,0.0000,0.0
4,2010,HAI,1.6400,0.0000,0.0004,0.0000,0.0000,0.0000,0.0000,0.0000,0.0009,0.0000,0.0000,0.0000,0.4500,0.0000,0.1000,0.0000,0.0

In [126]:
Temp_df.head()

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [127]:
ed_types = []
for x in dataframes[1]['Indicator Name'].unique():
    older_t_15_test = (x.find('15+') > -1)
    gender_test = (x.lower().find('female')==-1) & (x.lower().find('male')==-1)
    data_set_test = ((x.find('Barro') >-1) | (x.find('Witt') >-1)) & (x.lower().find('percent')>-1)
    if older_t_15_test & gender_test & data_set_test:
        ed_types.append(x)

In [247]:
Ed_df = dataframes[1].copy()

Ed_df = Ed_df[Ed_df['Indicator Name'].isin(ed_types)]
col = [colm for colm in Ed_df.columns[4:-1] if (int(colm) > 2011 and int(colm) < 2022)]
col.extend(Ed_df.columns[:3])
Ed_df = Ed_df[col].reset_index(drop = True)
Ed_df = Ed_df.melt(id_vars = ['Country Name', 'Country Code', 'Indicator Name'], var_name = 'Year', value_name = 'Percent')
Ed_df = Ed_df[~np.array(Ed_df['Percent'].isna())].reset_index(drop = True)
#Ed_df.groupby(['Country Name', 'Country Code', 'Year'])
ed_score_list = []
for name in Ed_df['Indicator Name']:
    if (name.lower().find('tertiary') > -1) | (name.lower().find('post secondary') > -1):
        ed_score_list.append('pct_some_ter')
    elif name.lower().find('secondary') > -1:
        ed_score_list.append('pct_some_sec')
    else:
        ed_score_list.append('pct_lt_sec')
        
Ed_df['Education Score']=ed_score_list
Ed_df = Ed_df.drop('Indicator Name', axis = 1)
Ed_df = Ed_df.groupby(['Country Name', 'Country Code', 'Year','Education Score']).max().reset_index()
Ed_df = Ed_df.pivot(index = ['Country Name', 'Country Code', 'Year'], columns = 'Education Score', values = 'Percent').reset_index()
flag = 0
for x in Ed_df['Country Code'].unique():
    dummy_df = pd.DataFrame()
    dummy_df['Year'] = [str(yr) for yr in range(2012,2021)]
    dummy_df['Country Code'] = [x for yr in range(2012,2021)]
    if flag == 0:
        yr_df= dummy_df
        flag = 1
    else:
        yr_df = yr_df.append(dummy_df)
Ed_df = Ed_df.merge(yr_df, on = ['Year','Country Code'], how = 'right')
Ed_df = Ed_df.drop('Country Name',axis = 1).sort_values('Country Code').reset_index(drop = True)
Ed_df = Ed_df.fillna(method = 'bfill').head()

In [248]:
yr_df

    Year Country Code
0   2012          ALB
1   2013          ALB
2   2014          ALB
3   2015          ALB
4   2016          ALB
..   ...          ...
4   2016          ZWE
5   2017          ZWE
6   2018          ZWE
7   2019          ZWE
8   2020          ZWE

[1503 rows x 2 columns]

In [176]:
QoL_df.head()

,year,City,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Country
0,2012-Q1,Berlin,215.25,140.62,77.34,64.81,89.06,5.74,23.00,40.00,Germany
1,2012-Q1,Zurich,213.18,136.31,83.85,77.78,166.07,8.27,27.33,26.50,Switzerland
2,2012-Q1,Edmonton,204.86,124.69,58.98,78.89,112.10,3.59,35.33,21.25,Canada
3,2012-Q1,Perth,196.00,118.34,48.75,87.04,142.18,5.24,27.00,15.00,Australia
4,2012-Q1,Calgary,190.78,124.25,71.88,70.42,111.71,4.58,62.00,25.08,Canada

In [132]:
Rel_df['year'].unique()

array([2010], dtype=int64)

In [140]:
Age_df.head()

          Country  Time AgeGrp  AgeGrpPct
1302  Afghanistan  2012    0-4  17.356145
1303  Afghanistan  2012    5-9  15.870758
1304  Afghanistan  2012  10-14  13.862917
1305  Afghanistan  2012  15-19  11.174352
1306  Afghanistan  2012  20-24   8.703264

In [200]:
Temp_df = dataframes[0].copy()
Temp_df = Temp_df.drop(['Month','Day'],axis = 1)
Temp_df = Temp_df[np.array(Temp_df['Year']>2010)&np.array(Temp_df['Year']<2021)].reset_index(drop = True)
Temp_df = Temp_df.drop('Region',axis = 1)
Temp_df = Temp_df.groupby(['Country', 'State', 'City', 'Year']).mean().reset_index()

In [201]:
City_pop_df.head()

,Country Code,Country or area,City Code,Urban Agglomeration,Note,Latitude,Longitude,1950,1955,1960,...,1985,1990,1995,2000,2005,2010,2015,2020,2025,2030
0,392,Japan,21671,Tokyo,325.0,35.689500,139.691710,"11,275","13,713","16,679",...,"30,304","32,530","33,587","34,450","35,622","36,834","38,001","38,323","37,876","37,190"
1,356,India,21228,Delhi,318.0,28.666670,77.216670,"1,369","1,782","2,283",...,"7,325","9,726","12,407","15,732","18,670","21,935","25,703","29,348","32,727","36,060"
2,156,China,20656,Shanghai,202.0,31.220000,121.460000,"4,301","5,846","6,820",...,"6,847","7,823","10,450","13,959","16,763","19,980","23,741","27,137","29,442","30,751"
3,76,Brazil,20287,SÃ£o Paulo,NaN,-23.550000,-46.640000,"2,334","3,044","3,970",...,"13,395","14,776","15,913","17,014","18,288","19,660","21,066","22,119","22,899","23,444"
4,356,India,21206,Mumbai (Bombay),NaN,19.073975,72.880838,"2,857","3,432","4,060",...,"10,391","12,436","14,310","16,367","17,891","19,422","21,043","22,838","25,207","27,797"

In [282]:
City_pop_df = dataframes[2].copy()
col = [City_pop_df.columns[1],City_pop_df.columns[3]]
col.extend([x for x in City_pop_df.columns[7:-1] if (int(x)>2009) & (int(x)<2021)])
City_pop_df = City_pop_df[col]
City_pop_df = City_pop_df.melt(id_vars = ['Country or area', 'Urban Agglomeration'], var_name = 'Year', value_name = 'Pop in Thousands')
flag = 0
City_pop_df['Country City'] = City_pop_df['Country or area'] + ',' + City_pop_df['Urban Agglomeration']
pop_2010 = {row['Country City'] : row['Pop in Thousands'] for idx,row in City_pop_df.iterrows() if row['Year'] == '2010'}
pop_2015 = {row['Country City'] : row['Pop in Thousands'] for idx,row in City_pop_df.iterrows() if row['Year'] == '2015'}
pop_2020 = {row['Country City'] : row['Pop in Thousands'] for idx,row in City_pop_df.iterrows() if row['Year'] == '2020'}

for name in City_pop_df['Country City'].unique():
    dummy_df = pd.DataFrame()
    dummy_df['Year'] = [str(yr) for yr in range(2010,2021)]
    dummy_df['Country City'] = [name for yr in range(2010,2021)]
    if flag ==0:
        yr_df = dummy_df
        flag = 1
    else:
        yr_df = yr_df.append(dummy_df)
City_pop_df = City_pop_df.merge(yr_df, on = ['Year','Country City'], how = 'right')
city_list = list(City_pop_df['Country City'].str.split(','))
country_list = []
city_list_df = []
for city in city_list:
    country_list.append(city[-1])
    city_list_df.append( city[0])
City_pop_df['Country or area'] = country_list
City_pop_df['Urban Agglomeration'] = city_list_df
for idx, row in City_pop_df.iterrows():
    yr = int(row['Year'])
    p2010 = int(pop_2010[row['Country City']].replace(',',''))
    p2015 = int(pop_2015[row['Country City']].replace(',',''))
    p2020 = int(pop_2020[row['Country City']].replace(',',''))
    if yr<2015:
        yr = yr - 2010
        pop = int((p2015 - p2010)*yr/5 + p2010)
    else:
        yr = yr - 2015
        pop = int((p2020 - p2015)*yr/5 + p2015)
    pop_list.append(pop)

City_pop_df['Pop in Thousands'] = pop_list
City_pop_df = City_pop_df.drop('Country City',axis = 1)
City_pop_df.columns = ['City','Country', 'Year', 'Pop in Thousands']
City_pop_df.head()

    City Country  Year  Pop in Thousands
0  Tokyo   Japan  2010             36834
1  Tokyo   Japan  2011             37067
2  Tokyo   Japan  2012             37300
3  Tokyo   Japan  2013             37534
4  Tokyo   Japan  2014             37767

In [279]:
pop

288

In [257]:
entry

('Country',
 0           Tokyo
 1           Tokyo
 2           Tokyo
 3           Tokyo
 4           Tokyo
            ...
 18591    Katowice
 18592    Katowice
 18593    Katowice
 18594    Katowice
 18595    Katowice
 Name: Country, Length: 18596, dtype: object)